"""Константы для тестирования"""

# Некорректные типы данных для тестов карт
INVALID_ISDIGIT_CASES = [
    12.45,  # float
    [123, [123, 123]],  # вложенный список
    [[1], [2], [3], [4], [4], 3, 5, 6, 7, 8, 9, 3, 4, 5, 6, 7],  # список с 16 элементами
    {},  # пустой словарь
    (),  # пустой кортеж
    None,  # None
    '',  # пустая строка
    '1234 5678 9012 3456',  # строка с пробелами
    '1234-5679-0123-4567',  # строка с дефисами
    'asdfqwerasdfqwer',  # буквы
    '1234qwer5678qwer',  # буквы и цифры
    '2024-99-99T23:59:59.999999',
    '204-112-331T23:59:59.999999'
]

# Некорректные длины для тестов карт
INVALID_LENGTH_CASES = [
    1234,  # слишком короткое число
    '1234',  # слишком короткая строка
    0,  # ноль
    12345678901234567890,  # слишком длинное число
    '12345678901234567890'  # слишком длинная строка
]

CARD_TYPES = [
    "Visa",  # самая распространенная
    "MasterCard",  # вторая по популярности
    "Мир",  # российская платежная система
    "Maestro",  # дебетовые карты
    "American Express",  # премиальные карты
    "UnionPay",  # китайская платежная система
    "JCB",  # японские карты
    "Diners Club",  # исторически первая
    "Visa Classic",
    "Visa Platinum",
    "Visa Platinum"
]

VALID_EDGE_CASES_CARD = [(1000000000000000, "1000 00** **** 0000"),
                         ('0000000000000000', "0000 00** **** 0000"),
                         (9999999999999999, "9999 99** **** 9999"),
                         ("9999999999999999", "9999 99** **** 9999")]

VALID_EDGE_CASES_ACCOUNT = [(1000000000000000, "**0000"),
                            ('0000000000000000', "**0000"),
                            (9999999999999999, "**9999"),
                            ("9999999999999999", "**9999")]

INVALID_NUMBERS_WITH_SPACES = [' 1234567890123456', '1234567890123456 ', ' 1234567890123456 ']

