"""Константы для тестирования"""

# ========ОЩИЕ ДЛЯ НЕСКОЛЬКИХ МОДУЛЕЙ==============
# Используется в: masks.py, widget.py, processing.py
INVALID_TYPE_CASES = [
    12.45,  # float
    [123, [123, 123]],  # вложенный список
    [[1], [2], [3], [4], [4], 3, 5, 6, 7, 8, 9, 3, 4, 5, 6, 7],  # список с 16 элементами
    {},  # пустой словарь
    (),  # пустой кортеж
    None,  # None
]
# Используется в: masks.py, widget.py, processing.py
INVALID_VALUE_CASES = [
    "",  # пустая строка
    "executed",
    "canceled",
    "EXECUT",
    "1234 5678 9012 3456",  # строка с пробелами
    "1234-5679-0123-4567",  # строка с дефисами
    "asdfqwerasdfqwer",  # буквы
    "1234qwer5678qwer",  # буквы и цифры
    "2024-99-99T23:59:59.999999",
    "204-112-331T23:59:59.999999",
]

# Используется в: masks.py, widget.py
INVALID_LENGTH_CASES = [
    1234,  # слишком короткое число
    "1234",  # слишком короткая строка
    0,  # ноль
    12345678901234567890,  # слишком длинное число
    "12345678901234567890",  # слишком длинная строка
]

# Используется в: masks.py, widget.py
VALID_EDGE_CASES_CARD = [
    (1000000000000000, "1000 00** **** 0000"),
    ("0000000000000000", "0000 00** **** 0000"),
    (9999999999999999, "9999 99** **** 9999"),
    ("9999999999999999", "9999 99** **** 9999"),
]
# Используется в: masks.py, widget.py
VALID_EDGE_CASES_ACCOUNT = [
    (1000000000000000, "**0000"),
    ("0000000000000000", "**0000"),
    (9999999999999999, "**9999"),
    ("9999999999999999", "**9999"),
]

# ========СПЕЦИФИЧНЫЕ ДЛЯ ОДНОГО МОДУЛЯ==============
# Используется в: masks.py
INVALID_NUMBERS_WITH_SPACES = [" 1234567890123456", "1234567890123456 ", " 1234567890123456 "]

# Используется в: widget.py
CARD_TYPES = [
    "Visa",  # самая распространенная
    "MasterCard",  # вторая по популярности
    "Мир",  # российская платежная система
    "Maestro",  # дебетовые карты
    "American Express",  # премиальные карты
    "UnionPay",  # китайская платежная система
    "JCB",  # японские карты
    "Diners Club",  # исторически первая
    "Visa Classic",
    "Visa Platinum",
    "Visa Platinum",
]

# Используется в: generators.py
INVALID_TYPE_CASES_WITHOUT_LIST = [
    12.45,  # float
    {},  # пустой словарь
    (),  # пустой кортеж
    None,  # None
    123556,
    "1234235345",
]

# Используется в: generators.py
VALID_BUT_EMPTY_RETERN = [
    [],
    [[], [[]]],
    [{}, {}],
    [
        {
            "id": 3,
            "operationAmount": {
                "currency": {"name": "", "code": ""},
            },
        }
    ],
    [
        {
            "id": 3,
            "operationAmount": {
                "currency": {"name": None, "code": None},
            },
        }
    ],
]
